{"config": {"name": "model_8", "output_layers": [["test_output", 0, 0]], "layers": [{"name": "test_input", "config": {"name": "test_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "vgg_partial", "config": {"name": "vgg_partial", "output_layers": [["block5_conv3", 0, 0]], "layers": [{"name": "input_4", "config": {"name": "input_4", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 64, "bias_regularizer": null, "name": "block1_conv1", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 64, "bias_regularizer": null, "name": "block1_conv2", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 128, "bias_regularizer": null, "name": "block2_conv1", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 128, "bias_regularizer": null, "name": "block2_conv2", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 256, "bias_regularizer": null, "name": "block3_conv1", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 256, "bias_regularizer": null, "name": "block3_conv2", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 256, "bias_regularizer": null, "name": "block3_conv3", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block4_conv1", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block4_conv2", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block4_conv3", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block5_conv1", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block5_conv2", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 512, "bias_regularizer": null, "name": "block5_conv3", "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]]}, "class_name": "Model", "inbound_nodes": [[["test_input", 0, 0, {}]]]}, {"name": "counting_output", "config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "counting_output", "kernel_constraint": null, "trainable": true, "use_bias": true, "dtype": "float32", "data_format": "channels_last", "strides": [1, 1], "filters": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["vgg_partial", 1, 0, {}]]]}, {"name": "test_output", "config": {"name": "test_output", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxMAAAB0AABqAQB8AABkAQBkBACDAQFTKQVO2gRheGlz6QEA\nAADpAgAAACkCcgIAAAByAwAAACkC2gFL2gNzdW0pAdoBaakAcgcAAAD6D2tlcmFzX3NjcmlwdC5w\nedoIPGxhbWJkYT4mAQAAcwAAAAA=\n", null, null], "trainable": true, "output_shape": null, "dtype": "float32", "arguments": {}, "function_type": "lambda"}, "class_name": "Lambda", "inbound_nodes": [[["counting_output", 0, 0, {}]]]}], "input_layers": [["test_input", 0, 0]]}, "keras_version": "2.1.4-tf", "backend": "tensorflow", "class_name": "Model"}